# 문제
# 피보나치 수는 0과 1로 시작한다. 0번째 피보나치 수는 0이고, 1번째 피보나치 수는 1이다. 그 다음 2번째 부터는 바로 앞 두 피보나치 수의 합이 된다.

# 이를 식으로 써보면 Fn = Fn-1 + Fn-2 (n ≥ 2)가 된다.

# n=17일때 까지 피보나치 수를 써보면 다음과 같다.

# 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597

# n이 주어졌을 때, n번째 피보나치 수를 구하는 프로그램을 작성하시오.

# 입력
# 첫째 줄에 n이 주어진다. n은 45보다 작거나 같은 자연수이다.

# 출력
# 첫째 줄에 n번째 피보나치 수를 출력한다.

n = int(input())

# 재귀 함수를 사용하여 피보나치 수를 계산하는 함수
# 시간 복잡도: O(2^n) - 너무 느림
def fibonacci(n):
    if n == 0:
        return 0
    elif n== 1:
        return 1
    else:
        return fibonacci(n-1) + fibonacci(n-2)

# 동적 프로그래밍을 사용하여 피보나치 수를 계산하는 함수
# 시간 복잡도: O(n) - 효율적
def fibonacci_dp(n):
    fib = [0 for _ in range(n + 1)] # [0, 0, 0, ..., 0] (n+1개의 0으로 초기화)
    fib[1] = 1 # [0, 1, 0, ..., 0] (1번째 피보나치 수는 1)
    for i in range(2, n + 1):
        fib[i] = fib[i - 1] + fib[i - 2]
    return fib[n]

print(fibonacci_dp(n))